openwch/ch32v003/Demo Application/Easy_PD_Sink/Easy_PD_Sink_pro/sdk/Peripheral/src/ch32v00x_i2c.c
    return bitstatus;
}

/*********************************************************************
 * @fn      I2C_ClearITPendingBit
 *
 * @brief   Clears the I2Cx interrupt pending bits.
 *
 * @param   I2Cx - where x can be 1 to select the I2C peripheral.
 *          I2C_IT - specifies the interrupt pending bit to clear.
 *            I2C_IT_PECERR - PEC error in reception  interrupt.
 *            I2C_IT_OVR - Overrun/Underrun interrupt (Slave mode).
 *            I2C_IT_AF - Acknowledge failure interrupt.
 *            I2C_IT_ARLO - Arbitration lost interrupt (Master mode).
 *            I2C_IT_BERR - Bus error interrupt.
 *          Note-
 *           - STOPF (STOP detection) is cleared by software sequence: a read operation 
 *             to I2C_STAR1 register (I2C_GetITStatus()) followed by a write operation to 
 *             I2C_CTLR1 register (I2C_Cmd() to re-enable the I2C peripheral).
 *           - ADD10 (10-bit header sent) is cleared by software sequence: a read 
 *             operation to I2C_STAR1 (I2C_GetITStatus()) followed by writing the second 
 *             byte of the address in I2C_DATAR register.
 *           - BTF (Byte Transfer Finished) is cleared by software sequence: a read 
 *             operation to I2C_STAR1 register (I2C_GetITStatus()) followed by a 
 *             read/write to I2C_DATAR register (I2C_SendData()).
 *           - ADDR (Address sent) is cleared by software sequence: a read operation to 
 *             I2C_STAR1 register (I2C_GetITStatus()) followed by a read operation to 
 *             I2C_STAR2 register ((void)(I2Cx->SR2)).
 *           - SB (Start Bit) is cleared by software sequence: a read operation to 
 *             I2C_STAR1 register (I2C_GetITStatus()) followed by a write operation to 
 *             I2C_DATAR register (I2C_SendData()).
 *
 * @return  none
 */
void I2C_ClearITPendingBit(I2C_TypeDef *I2Cx, uint32_t I2C_IT)
{
    uint32_t flagpos = 0;

    flagpos = I2C_IT & FLAG_Mask;
    I2Cx->STAR1 = (uint16_t)~flagpos;
}







